[
    {
        "title": "Clickbait classifier",
        "text": "For this project I am working with the ACED organisation to tackle clickbait on local Dutch news websites.\n\nACED has collected a large amount of news articles from most popular Dutch news sites, which we can use to determine what is, and what is not clickbait.\n\nWe hope to do this by making a small swiper game where people can decide which articles are actually clickbait. With these results we can make machine learning models which can automatically determine if a news article is clickbait or not.\n\nEventually the goal is to implement this model into a browser extension that can warn users of clickbait and generate more awareness around the subject.",
        "snippet": "Classifier to tackle clickbait on news websites.",
        "skills": "Data engineering, Pyhton, Flask, MongoDB, React, Javascript",
        "git": "https://github.com/En-ju-neer-s",
        "coverImage": "./portfolio-images/clickbait-classifier/classifier-1.jpg",
        "images": [
            "./portfolio-images/clickbait-classifier/classifier-1.jpg"
        ]
    },
    {
        "title": "Rocto (LoCoSoRoP)",
        "text": "For this project I worked together with 2 different studies (Industrial Product Design, and Communication) to make a social robot for handicapped children.\n\nThe goal was to make this robot for them and the caretakers so all the children could get more attention since they require a lot, and there aren’t that many caretakers to entertain/take care of them all the time.\n\nWe visited the children a few times to test the product and eventually leave a prototype there for longer term testing.\n\nAnother goal was to keep the robot low cost, because currently there are only extremely expensive robots available for the healthcare industry. We achieved this by using cheaper materials and technologies, like arduino’s and home made sensors.\n\nIn the end we made an octopus with multiple sensors in its tentacles which produced sound and vibration when touched.\n\nWe also wrote some dynamic code which calibrated itself every once in a while since the homemade sensors were not that reliable",
        "snippet": "A low cost, social robot to give handicapped children more attention.",
        "skills": "Arduino, hardware, C+",
        "git": "https://github.com/locosorop-v4/Rocto",
        "coverImage": "./portfolio-images/rocto/rocto-1.jpg",
        "images": [
            "./portfolio-images/rocto/rocto-1.jpg",
            "./portfolio-images/rocto/rocto-2.jpg",
            "./portfolio-images/rocto/rocto-3.jpg",
            "./portfolio-images/rocto/rocto-4.jpg"
        ]
    },
    {
        "title": "Safe Routing Rotterdam",
        "text": "For this project I worked together with an app named Maxed Guardian which you can use to alert relatives when you don’t feel safe on the streets at night.\n\nWe decided to improve this app by building a ‘safe routing’ functionality. In a nutshell we tried to gather ‘crime’ data from the streets of Rotterdam and see if we could make a route generator that avoids these areas. We gathered this data from some open sourced data from the government about crime rates, and data from the app itself (where people were bothered or attacked).\n\nOf course this project raised a lot of questions and concerns but this challenged my ethics and motives in a good way.",
        "snippet": "Routing application using data to avoid potentially dangerous areas.",
        "skills": "Flask, Python, React, Javascript, map-box",
        "git": "https://github.com/route-guardian/map-demo",
        "coverImage": "./portfolio-images/rotterdam-safe-routing/routing-1.png",
        "images": [
            "./portfolio-images/rotterdam-safe-routing/routing-1.png",
            "./portfolio-images/rotterdam-safe-routing/routing-2.jpg"
        ]
    },
    {
        "title": "Yeaz!",
        "text": "During my first internship I worked for the client Yeaz! which is a loan platform for smaller companies. They aim to easily give out smaller loans to boost startups and small independent businesses.\n\nI worked on their web app which onboards people with a funnel that is easy and quick to use, and the dashboard itself where existing users can check their loans and repayments, and even request a top-up for their loan if they need more money.\n\nI learned a lot of new skills during this project like working with more data and visualizing this in meaningful ways. I worked closely with the designers and the client themselves to deliver exactly what they needed.",
        "snippet": "Web-app to acquire and manage loans for small businesses.",
        "skills": "React, Redux, Javascript, Scss",
        "coverImage": "./portfolio-images/yeaz/yeaz-1.png",
        "images": [
            "./portfolio-images/yeaz/yeaz-1.png",
            "./portfolio-images/yeaz/yeaz-2.png",
            "./portfolio-images/yeaz/yeaz-3.png"
        ]
    },
    {
        "title": "DotControl website",
        "text": "During my part-time employment at DotControl I was tasked to build their website, and that of their counterpart RockBoost. We did this in a small team, using the Umbraco Cloud as CMS system.\n\nThe idea was to make 2 websites with the same codebase since these 2 companies share the same styling and characteristics.\n\nThis yielded a couple of interesting problems but nothing we couldn’t figure out.\n\nIn the end the project consisted of a lot of animation and close teamwork with the design team.",
        "snippet": "Websites for DotControl and RockBoost and their new unified branding.",
        "skills": "Cshtml, Umbraco Cloud, Javascript, Scss",
        "coverImage": "./portfolio-images/dc-rb-website/dcrb-1.jpg",
        "images": [
            "./portfolio-images/dc-rb-website/dcrb-1.jpg"
        ]
    },
    {
        "title": "FedEx Boat AI",
        "text": "In my second year of CMGT FedEx approached us and asked us to think of a way to improve last-mile delivery using AI.\n\nTogether with a small team we applied scrum, spints, concepting and prototyping to realise our idea.\n\nAfter a couple of sprints we came up with the ‘autonomous delivery boat’. This boat is supposed to navigate through the canals of Amsterdam, and deliver packages to certain pick-up docks. People can mark the docks as pickup location and the boat will let them know when it’s docked there.\n\nIn the end I built a prototype for the lockers on the boat with a raspberry pi, so you can unlock it with your phone.\n\nWe also built an algorithm to simulate the boat path through the canals touching all the active pick-up points.",
        "snippet": "Last-mile delivery solution for FedEx using AI.",
        "skills": "Raspberry Pi, Python, JavaScript",
        "git": "https://github.com/boatai",
        "coverImage": "./portfolio-images/fedex/boatai-1.jpg",
        "images": [
            "./portfolio-images/fedex/boatai-2.jpg",
            "./portfolio-images/fedex/boatai-3.jpg",
            "./portfolio-images/fedex/boatai-4.jpg",
            "./portfolio-images/fedex/boatai-5.jpg",
            "./portfolio-images/fedex/boatai-6.jpg",
            "./portfolio-images/fedex/boatai-7.jpg",
            "./portfolio-images/fedex/boatai-1.jpg"
        ]
    },
    {
        "title": "Sleep Moderator",
        "text": "In my second year of CMGT we were assigned to come up with a ‘body enhancement.\n\nTogether with a small team we came up with an idea to improve sleep trackers by actually making them ‘smart’.\n\nWe came up with the idea to make the sleep tracker dynamically set alarms based on your sleep rhythm. For example to wake you up right after a period of deep sleep, because research shows you will feel better throughout the day. We also thought of a small gamification element to simulate the user to start sleeping better.\n\nIn this project I focussed on building the actual sleep tracking device. I built this using an arduino, and a pulse sensor. The data that came in through the arduino I sent to a database through a wifi module (esp-2866 module), so the user could see the data in the app. This also made it possible for us to study the data and determine if it was usable.",
        "snippet": "Smart sleep tracker improving sleep patterns.",
        "skills": "Arduino, C+, Hardware",
        "git": "https://github.com/markjhvonk/Arduino-pulse-sensor-wifi",
        "coverImage": "./portfolio-images/sleep-moderator/moderator-1.jpg",
        "images": [
            "./portfolio-images/sleep-moderator/moderator-2.jpg",
            "./portfolio-images/sleep-moderator/moderator-3.jpg",
            "./portfolio-images/sleep-moderator/moderator-4.jpg",
            "./portfolio-images/sleep-moderator/moderator-5.jpg",
            "./portfolio-images/sleep-moderator/moderator-6.jpg",
            "./portfolio-images/sleep-moderator/moderator-7.png"
        ]
    },
    {
        "title": "X-Cube",
        "text": "During a part-time job for a startup I worked on the X-Cube which is currently still in development. Unfortunately I can’t say much about it other then I got the opportunity to design and build a UI for a (very) large scale touch-based system.",
        "snippet": "Big UI/system for large scale touch devices.",
        "skills": "Electron, React, Framer-motion, Unity",
        "coverImage": "./portfolio-images/x-cube/x-cube-1.jpg",
        "images": [
            "./portfolio-images/x-cube/x-cube-1.jpg"
        ]
    }
]